username = 'Введите Ваше имя: '
title = 'Введите заголовок заметки: '
content = 'Введите описание заметки: '
status = 'Введите статус заметки: '
created_date ='Введите дату создания заметки, в формате dd.mm.yyyy: '
issue_date = 'Введите дату истечения срока заметки, в формате dd.mm.yyyy: '

print("Имя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date[:5])
print("Дата истечения заметки:", issue_date[:5])
