как итог функциональную базу для работы с заметками - не получил.
почему?
потому что - что то не так видимо делал
почему не так делал?
потому что - предзадачные роки не соответствуют поставленым задачам и приходится искать подсказки в сторонней литературе, плюсом - из за отсутсвия опыта, нет видения конечной картины, и как следствие отсутствует понимание промежуточных шагов.
Анализ: данная учебная программа не приспособлена для обучения с нуля
Косвенный Анализ: взята чужая программа и в нее вставлены домашние задания не соответствующие урокам.

к примеру на этапе1 задании2 требуется работа с датами  и временнымы переменными (При необходимости можете воспользоваться временной переменной temp_issue_date и temp_created_date) - нигде упоминаний что это и как работает нет.
