# username - имя пользователя
# title - заголовок заметки
# content - описание заметки
# status - статус заметки
# created_date - дата создания заметки в формате "день-месяц-год", например "10-11-2024"
# issue_date - дата истечения заметки (дедлайн) в формате "день-месяц-год", например "10-12-2024"
'''Присвоите им соответствующие значения и напечатайте с помощью функции print в виде print("Описание переменной:", переменная),
например print("Имя пользователя:", username)
Это основные элементы нашей заметки, с которыми мы будем работать в будущем: изменять status, при выполнении заметки,
проверять issue_date, чтобы узнать, истекла ли дата выполнения, править content, если пользователь решил,
что описание недостаточно конкретное и т.д.'''

# name = input('Введите имя: ')
# surname = input('Введите фамилию: ')
# print (f"Привет, {name} { surname}!")

info = "а роза упала на лапу азора"
print (info[2:7])
print (info[::-1])
print (info[::-3])
print (info[11:6:-1])
