# username - имя пользователя
# title - заголовок заметки
# content - описание заметки
# status - статус заметки
# created_date - дата создания заметки в формате "день-месяц-год", например "10-11-2024"
# issue_date - дата истечения заметки (дедлайн) в формате "день-месяц-год", например "10-12-2024"
'''Присвоите им соответствующие значения и напечатайте с помощью функции print в виде print("Описание переменной:", переменная),
например print("Имя пользователя:", username)
Это основные элементы нашей заметки, с которыми мы будем работать в будущем: изменять status, при выполнении заметки,
проверять issue_date, чтобы узнать, истекла ли дата выполнения, править content, если пользователь решил,
что описание недостаточно конкретное и т.д.'''

# name = input('Введите имя: ')
# surname = input('Введите фамилию: ')
# print (f"Привет, {name} { surname}!")

# info = "а роза упала на лапу азора"
# print (info[2:7])
# print (info[::-1])
# print (info[::-3])
# print (info[11:6:-1])

# num1 = float(input('Введите первое чилсо: '))
# num2 = float(input('Введите второе чилсо: '))
# sum_result = num1 + num2
# print(f"Сумма чисел: {sum_result}")
# age = int(input('Введите Ваш возраст: '))
# if age >=18:
#     print('Доступ разрешён.')
# else:
#     print('Доступ запрещён.')

# first_name = input('Введите Ваше имя: ')
# last_name = input('Введите Вашу фамилию: ')
# age = int(input('Введите Ваш возраст: '))
# if age >=18:
#     print(f'Приятно познакомиться, {first_name} {last_name}! Доступ разрешён.')
# else:
#     print(f'Приятно познакомиться, {first_name} {last_name}! Доступ запрещён.')

# number = int(input('Введите число: '))
# if number == 10:
#     print('Вы ввели десять.')
# else:
#     print('Это не десять.')

# name = input('Введите Ваше имя: ')
# num1 = float(input('Введите Ваш возраст: '))
# sum_result = num1 + int (5)
# print (f'Через пять лет Вам будет: {sum_result}')

# username = input('Введите Ваше имя: ')
# print(f'Имя пользователя: {username}')
# title = input('Введите заголовок заметки: ')
# print(f'Заголовок заметки: {title}')
# content = input('Введите описание заметки: ')
# print(f'Описание заметки: {content}')
# status = input('Введите статус заметки: ')
# print(f'Статус заметки: {status}')
# created_date = input('Введите дату создания заметки, в формате dd.mm.yyyy: ')
# print(f'Дата создания: {created_date}')
# issue_date = input('Введите дату истечения срока заметки, в формате dd.mm.yyyy: ')
# print(f'Дата истечения заметки (дедлайн): {issue_date}')

# username = ('Дмитрий')
# print(f'Имя пользователя: {username}')
# title = ('Note_manager')
# print(f'Заголовок заметки: {title}')
# content = ('Блокнот для записей')
# print(f'Описание заметки: {content}')
# status = ('Активная')
# print(f'Статус заметки: {status}')
# created_date = ('28.12.2024')
# print(f'Дата создания: {created_date}')
# issue_date = ('28.01.2025')
# print(f'Дата истечения заметки (дедлайн): {issue_date}')